# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [2]:
baby_names = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')
baby_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Id          1016395 non-null  int64
 2   Name        1016395 non-null  object
 3   Year        1016395 non-null  int64
 4   Gender      1016395 non-null  object
 5   State       1016395 non-null  object
 6   Count       1016395 non-null  int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

### Step 4. See the first 10 entries

In [3]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [4]:
baby_names.drop('Unnamed: 0', axis=1, inplace=True)

In [5]:
baby_names.head()

      Id     Name  Year Gender State  Count
0  11350     Emma  2004      F    AK     62
1  11351  Madison  2004      F    AK     48
2  11352   Hannah  2004      F    AK     46
3  11353    Grace  2004      F    AK     44
4  11354    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [6]:
baby_names['Gender'][baby_names['Gender'] == 'F'].count()

558846

In [7]:
baby_names['Gender'][baby_names['Gender'] == 'M'].count()

457549

### Step 7. Group the dataset by name and assign to names

In [8]:
names = baby_names.groupby(['Name'])
names

### Step 8. How many different names exist in the dataset?

In [9]:
names['Name'].nunique().count()

17632

### Step 9. What is the name with most occurrences?

In [11]:
frequency_name = names['Name'].value_counts().rename('amount').reset_index()

AttributeError: 'DataFrameGroupBy' object has no attribute 'value_counts'

In [15]:
frequency_name = baby_names['Name'].value_counts().rename('amount').reset_index()

In [17]:
baby_names.head()

      Id     Name  Year Gender State  Count
0  11350     Emma  2004      F    AK     62
1  11351  Madison  2004      F    AK     48
2  11352   Hannah  2004      F    AK     46
3  11353    Grace  2004      F    AK     44
4  11354    Emily  2004      F    AK     41

In [16]:
frequency_name.head()

    index  amount
0   Riley    1112
1   Avery    1080
2  Jordan    1073
3  Peyton    1064
4  Hayden    1049

In [18]:
frequency_name.max()

index     Zyriah
amount      1112
dtype: object

### Step 10. How many different names have the least occurrences?

In [ ]:
frequency_name['amount'].min()

In [ ]:
frequency_name[frequency_name['amount'] == frequency_name['amount'].min()].count()

### Step 11. What is the median name occurrence?

In [ ]:
frequency_name.sort_values('amount', ascending=False)

In [ ]:
frequency_name['amount'].median()

In [ ]:
frequency_name[frequency_name['amount'] == frequency_name['amount'].median()]

### Step 12. What is the standard deviation of names?

In [ ]:
frequency_name.std()

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [ ]:
frequency_name.describe()